Frontend/src/assets/msg/05_SMKUSERDATA.xml

<?xml version="1.0" encoding="UTF-8"?>
<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<SOAP-ENV:Header xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"/>
<SOAP-ENV:Body xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/">
<executeAction xmlns="http://services.tdeu.telekom.net/ServAndResMgmt/TechOrderMgmt/ProductionFulfillmentProvider_v01.00" xmlns:ns2="http://schemas.telekom.net/csdg_v01.01" xmlns:ns3="http://services.tdeu.telekom.net/ServAndResMgmt/TechOrderMgmt/ProductionFulfillmentProvider_v01.00/types" xmlns:ns4="http://system-services.t-home.telekom.de/ServiceManagement/OIS_Services_v01.00/common" xmlns:ns5="http://system-services.t-home.telekom.de/ServiceManagement/TechnicalOrderManagement/ProductionFulfillment_v01.01/types">
<ns3:context>
<ns2:technicalContext>
<ns2:from>de.telekom.ngssm.oss.idm.IDM:IDM</ns2:from>
<ns2:routingInfo>de.telekom.ngssm.oss.idm.IDM:IDM:ProductionFulfilmentProviderUM_SMKFF</ns2:routingInfo>
<ns2:messageId>IDM000000669092</ns2:messageId>
<ns2:currentSenderTimestampUTC>2018-01-22T15:13:35.059Z</ns2:currentSenderTimestampUTC>
<ns2:expiryOffsetInMillis>0</ns2:expiryOffsetInMillis>
</ns2:technicalContext>
<ns2:businessContext>
<ns2:processId>IDM000000669092</ns2:processId>
<ns2:processTypeId>IDMA_FULFILLMENT_USERMANAGEMENT</ns2:processTypeId>
</ns2:businessContext>
</ns3:context>
<ns3:data>
<ns5:executeAction>
<ns5:messageID>
<ns4:value>IDM000000669092</ns4:value>
</ns5:messageID>
<ns5:productionPlan>
<ns4:entityKey>
<ns4:keyA>14028</ns4:keyA>
</ns4:entityKey>
<ns4:state>
<ns4:value>readyForExecution</ns4:value>
</ns4:state>
<ns4:specification>
<ns4:specificationName>ProductionPlanSpec</ns4:specificationName>
<ns4:specificationID>ProductionPlanSpec</ns4:specificationID>
<ns4:characteristic>
<ns4:characteristicID>CRMAuftragsNummer</ns4:characteristicID>
<ns4:characteristicValue>IDM000000669092</ns4:characteristicValue>
</ns4:characteristic>
<ns4:characteristic>
<ns4:characteristicID>DueDate</ns4:characteristicID>
<ns4:characteristicValue>2018-01-22T16:13:34+01:00</ns4:characteristicValue>
</ns4:characteristic>
</ns4:specification>
<ns4:businessInteractionItem>
<ns4:specification>
<ns4:specificationName>SubscriptionServiceOrderItemSpec</ns4:specificationName>
<ns4:specificationID>SubscriptionServiceOrderItemSpec</ns4:specificationID>
</ns4:specification>
<ns4:service>
<ns4:specification>
<ns4:specificationName>xPlay</ns4:specificationName>
<ns4:specificationID>xPlay</ns4:specificationID>
<ns4:characteristic>
<ns4:characteristicID>TO-Nr</ns4:characteristicID>
<ns4:characteristicValue>622011520010</ns4:characteristicValue>
</ns4:characteristic>
</ns4:specification>
</ns4:service>
</ns4:businessInteractionItem>
<ns4:businessInteractionItem>
<ns4:entityKey>
<ns4:keyA>c6ff0951-17bd-4b70-a049-4623f09d1ad0</ns4:keyA>
</ns4:entityKey>
<ns4:specification>
<ns4:specificationName>NutzerServiceOrderItemSpec</ns4:specificationName>
<ns4:specificationID>NutzerServiceOrderItemSpec</ns4:specificationID>
</ns4:specification>
<ns4:service>
<ns4:entityKey>
<ns4:keyA>phaf.guid.100049016220115200100001</ns4:keyA>
</ns4:entityKey>
<ns4:specification>
<ns4:specificationName>Nutzer</ns4:specificationName>
<ns4:specificationID>Nutzer</ns4:specificationID>
<ns4:characteristic>
<ns4:characteristicID>GUID</ns4:characteristicID>
<ns4:characteristicValue>100049016220115200100001</ns4:characteristicValue>
</ns4:characteristic>
<ns4:characteristic>
<ns4:characteristicID>istHauptnutzer</ns4:characteristicID>
<ns4:characteristicValue>true</ns4:characteristicValue>
</ns4:characteristic>
<ns4:characteristic>
<ns4:characteristicID>Profilname</ns4:characteristicID>
<ns4:characteristicValue>Hauptnutzer</ns4:characteristicValue>
</ns4:characteristic>
<ns4:characteristic>
<ns4:characteristicID>Language</ns4:characteristicID>
<ns4:characteristicValue>de_DE</ns4:characteristicValue>
</ns4:characteristic>
<ns4:characteristic>
<ns4:characteristicID>Rufnummern</ns4:characteristicID>
</ns4:characteristic>
<ns4:characteristic>
<ns4:characteristicID>EMailAlias</ns4:characteristicID>
</ns4:characteristic>
<ns4:characteristic>
<ns4:characteristicID>VOIP Credentials</ns4:characteristicID>
<ns4:characteristic>
<ns4:characteristicID>Auth-Methods</ns4:characteristicID>
<ns4:characteristicValue>NBA</ns4:characteristicValue>
</ns4:characteristic>
<ns4:characteristic>
<ns4:characteristicID>PasswortGeaendert</ns4:characteristicID>
<ns4:characteristicValue>false</ns4:characteristicValue>
</ns4:characteristic>
</ns4:characteristic>
</ns4:specification>
</ns4:service>
</ns4:businessInteractionItem>
<ns4:businessInteractionItem>
<ns4:entityKey>
<ns4:keyA>8ddda235-9521-463c-9a56-533261cf5d00</ns4:keyA>
</ns4:entityKey>
<ns4:specification>
<ns4:specificationName>MediationServiceOrderItemSpec</ns4:specificationName>
<ns4:specificationID>MediationServiceOrderItemSpec</ns4:specificationID>
<ns4:characteristic>
<ns4:characteristicID>Mediation_Characteristic</ns4:characteristicID>
<ns4:characteristic>
<ns4:characteristicID>VoIP_Characteristic</ns4:characteristicID>
<ns4:characteristic>
<ns4:characteristicID>INID</ns4:characteristicID>
<ns4:characteristicValue>130149019900010000663067</ns4:characteristicValue>
</ns4:characteristic>
<ns4:characteristic>
<ns4:characteristicID>VTP-Domain</ns4:characteristicID>
<ns4:characteristicValue>telekom.de</ns4:characteristicValue>
</ns4:characteristic>
</ns4:characteristic>
<ns4:characteristic>
<ns4:characteristicID>User_Profile_Characteristic</ns4:characteristicID>
<ns4:characteristic>
<ns4:characteristicID>Nutzer</ns4:characteristicID>
<ns4:characteristic>
<ns4:characteristicID>GUID</ns4:characteristicID>
<ns4:characteristicValue>100049016220115200100001</ns4:characteristicValue>
</ns4:characteristic>
<ns4:characteristic>
<ns4:characteristicID>Profilname</ns4:characteristicID>
<ns4:characteristicValue>Hauptnutzer</ns4:characteristicValue>
</ns4:characteristic>
<ns4:characteristic>
<ns4:characteristicID>E-Mail_Alias</ns4:characteristicID>
</ns4:characteristic>
</ns4:characteristic>
<ns4:characteristic>
<ns4:characteristicID>ServiceProfil_ID</ns4:characteristicID>
</ns4:characteristic>
</ns4:characteristic>
</ns4:characteristic>
</ns4:specification>
<ns4:service>
<ns4:entityKey>
<ns4:keyA>f3c8d733-1a43-4e74-9c19-eda215d1f054</ns4:keyA>
</ns4:entityKey>
<ns4:specification>
<ns4:specificationName>Mediation</ns4:specificationName>
<ns4:specificationID>Mediation</ns4:specificationID>
</ns4:specification>
</ns4:service>
</ns4:businessInteractionItem>
<ns4:businessInteractionItem>
<ns4:entityKey>
<ns4:keyA>be4b5aad-c152-4ff2-b7b1-1a8589aa0d11</ns4:keyA>
</ns4:entityKey>
<ns4:state>
<ns4:value>inExecution</ns4:value>
</ns4:state>
<ns4:specification>
<ns4:specificationName>Nutzer managen</ns4:specificationName>
<ns4:specificationID>Nutzer managen</ns4:specificationID>
<ns4:characteristic>
<ns4:characteristicID>Nutzer</ns4:characteristicID>
<ns4:characteristic>
<ns4:characteristicID>EntityReference</ns4:characteristicID>
<ns4:characteristic>
<ns4:characteristicID>keyA</ns4:characteristicID>
<ns4:characteristicValue>c6ff0951-17bd-4b70-a049-4623f09d1ad0</ns4:characteristicValue>
</ns4:characteristic>
</ns4:characteristic>
</ns4:characteristic>
<ns4:characteristic>
<ns4:characteristicID>Mediation</ns4:characteristicID>
<ns4:characteristic>
<ns4:characteristicID>EntityReference</ns4:characteristicID>
<ns4:characteristic>
<ns4:characteristicID>keyA</ns4:characteristicID>
<ns4:characteristicValue>8ddda235-9521-463c-9a56-533261cf5d00</ns4:characteristicValue>
</ns4:characteristic>
</ns4:characteristic>
</ns4:characteristic>
</ns4:specification>
</ns4:businessInteractionItem>
</ns5:productionPlan>
</ns5:executeAction>
</ns3:data>
</executeAction>
</SOAP-ENV:Body>
</SOAP-ENV:Envelope>
